SET NAMES UTF8;
DROP DATABASE IF EXISTS qf;
CREATE DATABASE qf CHARSET=UTF8;
USE qf;

/*管理团队*/
CREATE TABLE qf_team(
  id INT PRIMARY KEY NOT NULL AUTO_INCREMENT,       #编号
  tname VARCHAR(8) NOT NULL,                        #领导姓名
  duty_name VARCHAR(32) NOT NULL,                   #担任职务
  picture VARCHAR(128)                              #照片
);

/*新闻报表*/
CREATE TABLE qf_news_reports(
  id INT PRIMARY KEY NOT NULL AUTO_INCREMENT,       #新闻编号
  title VARCHAR(32) NOT NULL,                       #新闻标题
  intro VARCHAR(355),                               #新闻简介
  show_img VARCHAR(128),                            #新闻缩略图片
  created_time VARCHAR(16) NOT NULL,                #发布时间
  news_id SMALLINT(5) NOT NULL,                     #新闻类型
  isShow BOOLEAN                                    #是否首页展示
);

/* 新闻类别 */
CREATE TABLE news_category(
  id INT PRIMARY KEY NOT NULL,                      #类型编号
  category_name VARCHAR(30) NOT NULL                #新闻类型
);


/*******************/
/******数据导入******/
/*******************/
/*管理团队*/
INSERT INTO qf_team (id,tname,duty_name,picture) VALUES
(NULL,"徐达","执行董事 董事会主席","./img/profile/team_1.jpg"),
(NULL,"白韬","执行董事 行政总裁","./img/profile/team_2.jpg"),
(NULL,"王剑飞","执行董事","./img/profile/team_3.jpg"),
(NULL,"冯伟成","执行董事 财务总监","./img/profile/team_4.jpg"),
(NULL,"白雷","副总裁","./img/profile/team_5.jpg"),
(NULL,"齐锦源","副总裁","./img/profile/team_6.jpg"),
(NULL,"贾民","副总裁兼华美奥集团公司董事长",NULL),
(NULL,"刘锡源","独立非执行董事",NULL),
(NULL,"沙振权","独立非执行董事",NULL),
(NULL,"静大成","独立非执行董事",NULL);

/*新闻分类*/
INSERT INTO news_category (id,category_name) VALUES
(1,'秦发资讯'),
(2,'行业资讯'),
(3,'秦发财报'),
(4,'公告通函'),
(5,'结构合约'),
(6,'行业分析');

/* 新闻信息 */
INSERT INTO qf_news_reports (id,title,intro,show_img,created_time,news_id,isShow) VALUES
(NULL,'热烈祝贺珠海秦发物流有限公司荣获广东省企业500强及广东流通行业百强称号',NULL,'20190902100012012.png','2019-09-02',1,1),
(NULL,'中国秦发集团青岛公司隆重开业 青岛市市南区相关领导出席开业盛典','9月27日，中国秦发集团有限公司青岛公司（下文简称“秦发集团青岛公司”）举行了隆重的开业典礼。青岛市市南区副区长辛民志、市南区商务局局长刘鹏飞、市南区财...','20181011160551551.png','2018-10-11',1,1),
(NULL,'秦发集团总部下基层学习活动全面展开',NULL,'201809051435283528.jpg','2018-09-05',1,1),
(NULL,'青岛市交通委赴秦发集团总部进行无车承运业务调研及合作深层讨论',NULL,'201808160947524752.jpg','2018-07-24',1,1),
(NULL,'凝心聚力、砥砺前行 ---中国秦发集团2018年半年度经营管理会议圆满结',NULL,'201808141554395439.png','2018-07-20',1,0),
(NULL,'中国秦发集团与青岛市市南区签订战略合作协议','2018年7月2日,中国秦发集团与青岛市市南区人民政府在青岛市签订了战略合作协议。','201807051555275527.jpg','2018-07-05',1,0),
(NULL,'徐吉华董事长到访朔州与朔州市委副书记、市长高键一行座谈','6月26日，徐吉华董事长一行到朔州考察，山西省朔州市委副书记、市长高键做了亲切接待','20180628172707277.jpg','2018-06-28',1,0),
(NULL,'55项新任务清单 国务院赋予自贸区更大改革自主权',NULL,'20180525095500550.jpg','2018-05-25',1,0),
(NULL,'中国秦发：实地考察被市场遗忘后又重新崛起的民营煤企',NULL,'201804251136453645.jpg','2018-04-25',1,0),
(NULL,'煤炭高质量发展怎么看怎么干',NULL,'20180417110633633.jpg','2018-04-13',1,0),
(NULL,'不看好下半年煤市是个错误的想法',NULL,'20180413110329329.jpg','2015-07-22',1,0),
(NULL,'基本面回暖开启煤炭股暴涨潮 3类题材机会显现',NULL,'20180315145704574.jpg','2015-06-10',1,0),
(NULL,'涨！神华等大型煤企如期上调6月份煤价',NULL,'201803151458335833.jpg','2015-06-02',1,0),
(NULL,'QDII2即将启动个人投资海外试点门槛100万',NULL,'20180315145805585.jpg','2015-05-27',1,0),
(NULL,'中港基金互认8080亿7月开闸，或将带领第二波港股上扬',NULL,'201803151457335733.jpg','2015-05-26',1,0),
(NULL,'神华：煤炭是我国不可替代的主体能源',NULL,NULL,'2015-05-22',1,0),
(NULL,'中港基金互认政策将公布 两地有望互售基金',NULL,NULL,'2015-05-22',1,0),
(NULL,'解读《关于深化煤炭管理体制改革的意见》',NULL,NULL,'2015-01-05',1,0),
(NULL,'一带一路"规划获批即将出台 将获财税政策支持',NULL,NULL,'2015-01-04',1,0),
(NULL,'山西推动煤炭产业"六型"转变 真正实现革命兴煤',NULL,NULL,'2015-01-03',1,0),
(NULL,'央企完成36家企业重组 能源领域将是重点',NULL,NULL,'2018-06-26',2,1),
(NULL,'中国对进口美国煤炭加收25%的关税的影响',NULL,NULL,'2018-06-19',2,1),
(NULL,'煤企兼并重组持续推进 内蒙古整合12家涉煤国企',NULL,NULL,'2018-05-31',2,1),
(NULL,'发改委多措施稳煤价 增加1亿吨优质产能',NULL,NULL,'2018-05-22',2,1),
(NULL,'煤价淡季大涨将遭调控 四大发电集团严禁采购高价市场煤',NULL,NULL,'2018-05-21',2,0),
(NULL,'煤炭钢铁兼并重组还有好戏会上演',NULL,NULL,'2018-05-10',2,0),
(NULL,'煤炭库存高企价格走低 进口煤限制政策重启',NULL,NULL,'2018-04-04',2,0),
(NULL,'蒙华铁路铺就南北共同发展新道路',NULL,NULL,'2018-03-20',2,0),
(NULL,'多项数据超预期 中国经济开局向好',NULL,NULL,'2018-03-15',2,0),
(NULL,'两会声音：2018年煤炭行业将有哪些大动作',NULL,NULL,'2018-03-13',2,0),
(NULL,'国务院印发《“十三五”节能减排综合工作方案》',NULL,NULL,'2017-01-05',2,0),
(NULL,'煤炭工业发展“十三五”规划（公开发布稿）',NULL,NULL,'2016-12-30',2,0),
(NULL,'证监会确认深港通下半年实施 港股正当时',NULL,NULL,'2015-06-16',2,0),
(NULL,'中港基金互认8080亿7月开闸，或将带领第二波港股上扬',NULL,NULL,'2015-05-26',2,0),
(NULL,'港交所为日成交额达6000亿港元作准备',NULL,NULL,'2015-05-04',2,0),
(NULL,'港股能源板块料"后发制人"',NULL,NULL,'2015-05-03',2,0),
(NULL,'政治局会议定调稳增长 大宗商品将走出底部',NULL,NULL,'2015-01-05',2,0),
(NULL,'煤炭利好来袭！中央政治局会议释放重要信号',NULL,NULL,'2015-01-05',2,0),
(NULL,'截至二零二零年七月三十一日月報表',NULL,NULL,'2020-08-05',3,1),
(NULL,'截至二零二零年六月三十日月報表',NULL,NULL,'2020-07-06',3,1),
(NULL,'截至二零二零年五月三十一日月報表',NULL,NULL,'2020-06-03',3,1),
(NULL,'二零一九年年報',NULL,NULL,'2020-05-12',3,1),
(NULL,'截至二零二零年四月三十日月報表',NULL,NULL,'2020-05-05',3,0),
(NULL,'截至二零二零年三月三十一日月報表',NULL,NULL,'2020-04-03',3,0),
(NULL,'截至二零二零年二月二十九日月報表',NULL,NULL,'2020-03-04',3,0),
(NULL,'截至二零二零年一月三十一日月報表',NULL,NULL,'2020-02-04',3,0),
(NULL,'截至二零一九年十二月三十一日月報表',NULL,NULL,'2020-01-06',3,0),
(NULL,'截至二零一九年十一月三十日月報表',NULL,NULL,'2019-12-03',3,0),
(NULL,'截至二零一九年十月三十一日月報表',NULL,NULL,'2019-11-04',3,0),
(NULL,'截至二零一九年九月三十日月報表',NULL,NULL,'2019-10-08',3,0),
(NULL,'2019中期報告',NULL,NULL,'2019-09-23',3,0),
(NULL,'截至二零一九年八月三十一日月報表',NULL,NULL,'2019-09-04',3,0),
(NULL,'截至二零一九年七月月三十一日月報表',NULL,NULL,'2019-08-06',3,0),
(NULL,'截至二零一九年六月三十日月報表',NULL,NULL,'2019-07-04',3,0),
(NULL,'截至二零一九年五月三十一日月報表',NULL,NULL,'2019-06-04',3,0),
(NULL,'截至二零一九年四月三十日月報表',NULL,NULL,'2019-05-07',3,0),
(NULL,'二零一八年年報',NULL,NULL,'2019-04-26',3,0),
(NULL,'截至二零一九年三月三十一日月報表',NULL,NULL,'2019-04-03',3,0),
(NULL,'截至二零一九年二月二十八日月報表',NULL,NULL,'2019-03-05',3,0),
(NULL,'截至二零一九年一月三十一日月報表',NULL,NULL,'2019-02-11',3,0),
(NULL,'截至二零一八年十二月三十一日月報表',NULL,NULL,'2019-01-07',3,0),
(NULL,'截至二零一八年十一月三十日月報表',NULL,NULL,'2018-12-06',3,0),
(NULL,'截至二零一八年十月三十一日月報表',NULL,NULL,'2018-11-06',3,0),
(NULL,'截至二零一八年九月三十日月報表',NULL,NULL,'2018-10-04',3,0),
(NULL,'2018中期報告',NULL,NULL,'2018-09-18',3,0),
(NULL,'截至二零一八年八月三十一日月報表',NULL,NULL,'2018-09-06',3,0),
(NULL,'截至二零一八年七月月三十一日月報表',NULL,NULL,'2018-08-06',3,0),
(NULL,'截至二零一八年六月三十日月報表',NULL,NULL,'2018-07-04',3,0),
(NULL,'截至二零一八年五月三十一日月報表',NULL,NULL,'2018-06-05',3,0),
(NULL,'截至二零一八年四月三十日月報表',NULL,NULL,'2018-05-07',3,0),
(NULL,'二零一七年年報',NULL,NULL,'2018-04-26',3,0),
(NULL,'二零一七年中期報告',NULL,NULL,'2017-09-22',3,0),
(NULL,'二零一六年年報',NULL,NULL,'2017-04-28',3,0),
(NULL,'二零一六年中期報告',NULL,NULL,'2016-09-15',3,0),
(NULL,'截至二零一六年六月三十日止六个月之中期業績',NULL,NULL,'2016-08-19',3,0),
(NULL,'二零一五年年報',NULL,NULL,'2016-05-19',3,0),
(NULL,'二零一四年年報',NULL,NULL,'2015-04-28',3,0),
(NULL,'二零一三年年報',NULL,NULL,'2015-01-05',3,0),
(NULL,'二零一四年中期報告',NULL,NULL,'2015-01-04',3,0),
(NULL,'二零一三年中期報告',NULL,NULL,'2015-01-03',3,0),
(NULL,'董事會召開日期','董事會召開日期',NULL,'2020-08-18',4,1),
(NULL,'盈利警告','盈利警告',NULL,'2020-08-14',4,1),
(NULL,'須予披露交易 - 收購PT SUMBER DAYA ENERGI 70%股權','須予披露交易 - 收購PT SUMBER DAYA ENERGI 70%股權',NULL,'2020-08-07',4,1),
(NULL,'2019環境、社會及管治報告','2019環境、社會及管治報告',NULL,'2020-07-27',4,1),
(NULL,'於二零二零年六月三十日舉行的股東週年大會投票結果',NULL,NULL,'2020-06-30',4,0),
(NULL,'致非登記持有人之通知信函及申請表格',NULL,NULL,'2020-05-12',4,0),
(NULL,'於二零二零年六月三十日召開的股東週年大會（「股東週年大會」）（或其任何續會）的代表委任表格',NULL,NULL,'2020-05-12',4,0),
(NULL,'股東週年大會通告',NULL,NULL,'2020-05-12',4,0),
(NULL,'購回授權及一般授權、建議重選退任董事及連續委任一名服務超過九年的獨立非執行董事及股東週年大會通告',NULL,NULL,'2020-05-12',4,0),
(NULL,'截至二零一九年十二月三十一日止年度之末期業績',NULL,NULL,'2020-05-06',4,0),
(NULL,'董事會召開日期',NULL,NULL,'2020-04-22',4,0),
(NULL,'截至二零一九年十二月三十一日止年度之未經審核全年業績',NULL,NULL,'2020-03-31',4,0),
(NULL,'刊發截至二零一九年十二月三十一日止年度之未經審核全年業績公佈及董事會會議通告',NULL,NULL,'2020-03-19',4,0),
(NULL,'盈利警告',NULL,NULL,'2020-03-11',4,0),
(NULL,'交易所通告 - 復牌',NULL,NULL,'2020-01-03',4,0),
(NULL,'內幕消息及恢復買賣',NULL,NULL,'2020-01-03',4,0),
(NULL,'短暫停牌',NULL,NULL,'2020-01-02',4,0),
(NULL,'交易所通告 - 短暫停牌',NULL,NULL,'2020-01-02',4,0),
(NULL,'致非登記持有人之通知信函及申請表格',NULL,NULL,'2019-09-23',4,0),
(NULL,'截至二零一九年六月三十日止六個月之中期業績',NULL,NULL,'2019-08-26',4,0),
(NULL,'董事會召開日期',NULL,NULL,'2019-08-14',4,0),
(NULL,'盈利警告',NULL,NULL,'2019-08-12',4,0),
(NULL,'2018 環境、社會及管治報告',NULL,NULL,'2019-07-26',4,0),
(NULL,'於二零一九年六月十八日舉行的股東週年大會投票結果',NULL,NULL,'2019-06-18',4,0),
(NULL,'公司秘書及授權代表變更',NULL,NULL,'2019-06-05',4,0),
(NULL,'購回授權及一般授權 建議重選退任董事 及 股東週年大會通告',NULL,NULL,'2019-04-26',4,0),
(NULL,'於二零一九年六月十八日召開的股東週年大會（「股東週年大會」）（或其任何續會）的代表委任表格',NULL,NULL,'2019-04-26',4,0),
(NULL,'股東週年大會通告',NULL,NULL,'2019-04-26',4,0),
(NULL,'董事名單與其角色和職能',NULL,NULL,'2019-04-03',4,0),
(NULL,'獨立非執行董事、 審核委員會成員、薪酬委員會主席 及提名委員會主席辭任及委任 及董事委員會組成的變動',NULL,NULL,'2019-04-03',4,0),
(NULL,'截至二零一八年十二月三十一日止年度之 全年業績',NULL,NULL,'2019-03-21',4,0),
(NULL,'董事會召開日期',NULL,NULL,'2019-03-11',4,0),
(NULL,'盈利警告',NULL,NULL,'2019-03-01',4,0),
(NULL,'内幕消息',NULL,NULL,'2019-01-25',4,0),
(NULL,'審核委員會職權範圍 （董事會採納於2012 年4 月1 日起生效 並於2016 年4 月29 日及2018 年12 月31 日修訂）',NULL,NULL,'2018-12-31',4,0),
(NULL,'更改香港主要營業地點的地址',NULL,NULL,'2018-11-30',4,0),
(NULL,'董事名單與其角色和職能',NULL,NULL,'2018-09-21',4,0),
(NULL,'獨立非執行董事、 審核委員會、薪酬委員會及 提名委員會成員辭任及委任',NULL,NULL,'2018-09-21',4,0),
(NULL,'截至二零一八年六月三十日止六個月 之中期業績公佈的公告之補充公告',NULL,NULL,'2018-08-24',4,0),
(NULL,'截至二零一八年六月三十日止六個月之中期業績',NULL,NULL,'2018-08-23',4,0),
(NULL,'盈利警告',NULL,NULL,'2018-08-13',4,0),
(NULL,'董事會召開日期',NULL,NULL,'2018-08-11',4,0),
(NULL,'債務重組及控股股東抵押股份',NULL,NULL,'2018-08-09',4,0),
(NULL,'2017環境、社會及管治報告',NULL,NULL,'2018-07-30',4,0),
(NULL,'於二零一八年六月二十七日舉行的股東週年大會投票結果',NULL,NULL,'2018-06-27',4,0),
(NULL,'须予披露交易 完成出售一艘货船',NULL,NULL,'2018-06-20',4,0),
(NULL,'有關出售一艘貨船的須予披露交易',NULL,NULL,'2018-06-04',4,0),
(NULL,'董事名單與其角色和職能',NULL,NULL,'2018-05-04',4,0),
(NULL,'執行董事辭任 及 本公司日期為二零一八年四月二十七日之 通函及股東週年大會通告之補充公佈',NULL,NULL,'2018-05-04',4,0),
(NULL,'购回授权及一般授权建议重选退任董事追认根据现有购股权计划售出购股权采纳新购股权计划终止现有购股权计划及股东周年大会通告',NULL,NULL,'2018-04-26',4,0),
(NULL,'于二零一八年六月二十七日召开的股东周年大会的代表委任表格',NULL,NULL,'2018-04-26',4,0),
(NULL,'股东周年大会通告',NULL,NULL,'2018-04-26',4,0),
(NULL,'珠海物流与珠海贸易股东股权质押合同',NULL,NULL,'2019-06-12',5,0),
(NULL,'珠海物流与珠海航运委托管理与承包经营合同',NULL,NULL,'2019-06-12',5,0),
(NULL,'珠海物流与珠海贸易委托管理与承包经营合同',NULL,NULL,'2019-06-12',5,0),
(NULL,'珠海物流与珠海航运股东股权质押合同',NULL,NULL,'2019-06-12',5,0),
(NULL,'珠海物流与珠海航运股东股权质押合同',NULL,NULL,'2016-08-18',5,0),
(NULL,'秦发物流与珠海航运委托管理与承包经营合同',NULL,NULL,'2016-08-18',5,0),
(NULL,'珠海物流与珠海贸易股东股权质押合同',NULL,NULL,'2016-08-18',5,0),
(NULL,'秦发物流与珠海贸易委托管理与承包经营合同',NULL,NULL,'2015-08-17',5,0),
(NULL,'机构：下半年全球煤炭或供不应求',NULL,NULL,'2018-07-24',6,0),
(NULL,'煤炭开采行业:央行连续出手助房市加速回暖,再次强调买入煤炭股',NULL,NULL,'2015-05-05',6,0),
(NULL,'分析 | 珠海缔交友好城市 为何最高领导见证？',NULL,NULL,'2015-05-05',6,0),
(NULL,'港股迎来内资风口上的"大时代"',NULL,NULL,'2015-01-03',6,0);